---
kind: other
id: Properties.T:Autodesk.Revit.DB.StringParameterValue
source: html/fe70c7c7-ccc5-459c-f96d-a36ddfcaf4a3.htm
---
# StringParameterValue Properties

Specifies whether the .NET object represents a valid Revit entity.